// var a = +prompt('Введите ваш возраст')
// if( a <= 18 ){
//     alert('Вы ещё молоды, Вам надо ещё учиться' )
// }

// else if( a <= 50 ){
//     alert('Вам нужно работать ' )
// }

// else if( a <= 59 ){
//     alert('Вам скоро на пенсию' )
// }

// else if( a <= 100 ){
//     alert('Вы пенсионер' )
// } 

// else{
//     alert('Что то пошло не так')
// }

//==============================================================================================================================


// var b = +prompt('Введите время')
// switch (b) {
//     case 0:
//         alert('12 часов ночи')
//         break;
//     case 1:
//         alert('1 час ночи')
//         break;
//     case 2:
//         alert('2 часа ночи')
//         break;
//     case 3:
//         alert('3 часа ночи')
//         break;
//     case 4:
//         alert('4 часа ночи')
//         break;
//     case 5:
//         alert('5 часа ночи')
//         break;
//     case 6:
//         alert('6 часа ночи')
//         break;
//     case 7:
//         alert('7 часов утра')
//         break;
//     case 8:
//         alert('8 часов утра')
//         break;
//     case 9:
//         alert('9 часов утра')
//         break;
//     case 10:
//         alert('10 часов утра')
//         break;
//     case 11:
//         alert('11 часов дня')
//         break;
//     case 12:
//         alert('12 часов дня')
//         break;
//     case 13:
//         alert('час дня')
//         break;
//     case 14:
//         alert('2 часа дня')
//         break;
//     case 15:
//         alert('3 часа дня')
//         break;
//     case 16:
//         alert('4 часа дня')
//         break;
//     case 17:
//         alert('5 часов дня')
//         break;
//     case 18:
//         alert('6 часов вечера')
//         break;
//     case 19:
//         alert('7 часов вечера')
//         break;
//     case 20:
//         alert('8 часов вечера')
//         break;
//     case 21:
//         alert('9 часов вечера')
//         break;
//     case 22:
//         alert('10 часов вечера')
//         break;
//     case 23:
//         alert('11 часов вечера')
//         break;
//     default:
//         alert(
//             'Введите правильное время'
//         )
//         break;
// }

//=================================================================================================================================

// var a = +prompt('Введите число')
// var b = +prompt('Введите число')
// var c = +prompt('Введите число')


//================================================================================================================================

// var a = +prompt('Введите число для возведения')
// var b = +prompt('Введите степень')
// var c = Math.pow(a, b)
// alert(c)

//=================================================================================================================================

